In [1]:
import numpy as np
import pandas as pd

In [2]:
Employee_data = pd.DataFrame({'EmployeeID': [101,102,103,104,105],'Name':['Alice', 'Bob', 'Charlie', 'David', 'Eva'],'Department':['HR','IT','Finance','IT','HR'],'Salary':[50000,60000,55000,65000,58000]})

In [4]:
Employee_data

   EmployeeID     Name Department  Salary
0         101    Alice         HR   50000
1         102      Bob         IT   60000
2         103  Charlie    Finance   55000
3         104    David         IT   65000
4         105      Eva         HR   58000

In [5]:
Employee_data[['Name','Salary']]

      Name  Salary
0    Alice   50000
1      Bob   60000
2  Charlie   55000
3    David   65000
4      Eva   58000

In [6]:
it_employees = Employee_data[Employee_data['Department'] == 'IT']

average_salary = it_employees['Salary'].mean()

In [7]:
average_salary

np.float64(62500.0)

In [8]:
Employee_data['Bonus'] = Employee_data['Salary'] * 0.10

In [9]:
Employee_data

   EmployeeID     Name Department  Salary   Bonus
0         101    Alice         HR   50000  5000.0
1         102      Bob         IT   60000  6000.0
2         103  Charlie    Finance   55000  5500.0
3         104    David         IT   65000  6500.0
4         105      Eva         HR   58000  5800.0

In [11]:
Employee_data

   EmployeeID     Name Department  Salary   Bonus
0         101    Alice         HR   50000  5000.0
1         102      Bob         IT   60000  6000.0
2         103  Charlie    Finance   55000  5500.0
3         104    David         IT   65000  6500.0
4         105      Eva         HR   58000  5800.0

In [12]:
Employee_data.rename(columns={'EmployeeID':'ID'},inplace=True)

In [13]:
Employee_data

    ID     Name Department  Salary   Bonus
0  101    Alice         HR   50000  5000.0
1  102      Bob         IT   60000  6000.0
2  103  Charlie    Finance   55000  5500.0
3  104    David         IT   65000  6500.0
4  105      Eva         HR   58000  5800.0

In [14]:
Employee_data.drop(columns=['Department'], inplace=True)

In [15]:
Employee_data

    ID     Name  Salary   Bonus
0  101    Alice   50000  5000.0
1  102      Bob   60000  6000.0
2  103  Charlie   55000  5500.0
3  104    David   65000  6500.0
4  105      Eva   58000  5800.0

2Q) PRODUCT_DETAILS

In [16]:
p_data= {
    'Month': ['Jan', 'Feb', 'Mar', 'Apr', 'May'],
    'Product_A': [150, 200, 250, 300, 350],
    'Product_B': [300, 250, 200, 150, 100]
}
Product_details = pd.DataFrame(p_data)

In [17]:
Product_details

  Month  Product_A  Product_B
0   Jan        150        300
1   Feb        200        250
2   Mar        250        200
3   Apr        300        150
4   May        350        100

In [18]:
product_a = Product_details['Product_A'].sum()
product_b = Product_details['Product_B'].sum()

In [19]:
product_a

np.int64(1250)

In [20]:
product_b

np.int64(1000)

In [21]:
max_a = Product_details['Month'][Product_details['Product_A'].idxmax()]

In [22]:
Product_details

  Month  Product_A  Product_B
0   Jan        150        300
1   Feb        200        250
2   Mar        250        200
3   Apr        300        150
4   May        350        100

In [23]:
max_a

'May'

In [24]:
Product_details['Total_Sales'] = Product_details['Product_A'] + Product_details['Product_B']

In [25]:
Product_details

  Month  Product_A  Product_B  Total_Sales
0   Jan        150        300          450
1   Feb        200        250          450
2   Mar        250        200          450
3   Apr        300        150          450
4   May        350        100          450

In [26]:
max_a = Product_details['Product_A'].max()
Product_details['A_Normalized'] = Product_details['Product_A'] / max_a

In [27]:
Product_details

  Month  Product_A  Product_B  Total_Sales  A_Normalized
0   Jan        150        300          450      0.428571
1   Feb        200        250          450      0.571429
2   Mar        250        200          450      0.714286
3   Apr        300        150          450      0.857143
4   May        350        100          450      1.000000

In [28]:
filtered_pr = Product_details[Product_details['Total_Sales'] > 400]

In [31]:
filtered_pr

  Month  Product_A  Product_B  Total_Sales  A_Normalized
0   Jan        150        300          450      0.428571
1   Feb        200        250          450      0.571429
2   Mar        250        200          450      0.714286
3   Apr        300        150          450      0.857143
4   May        350        100          450      1.000000

3Q) CUSTOMER_DATASET

In [39]:
customer_data = {
    'CustomerID': [1, 2, 3, 4, 5],
    'Name': ['John', 'Jane', None, 'Alice', 'Bob'],
    'Purchase': [200, 300, 150, None, 500]
}
customer_data= pd.DataFrame(customer_data)

In [40]:
customer_data

   CustomerID   Name  Purchase
0           1   John     200.0
1           2   Jane     300.0
2           3   None     150.0
3           4  Alice       NaN
4           5    Bob     500.0

In [41]:
missing_value = customer_data.isnull().sum()

In [42]:
missing_value

CustomerID    0
Name          1
Purchase      1
dtype: int64

In [44]:
customer_data = customer_data.assign(Name=customer_data['Name'].fillna('Unknown'))

In [45]:
median_purchase = customer_data['Purchase'].median()
customer_data = customer_data.assign(Purchase=customer_data['Purchase'].fillna(median_purchase))

In [46]:
customer_data.dropna(inplace=True)

In [47]:
filtered_data = customer_data[customer_data['Purchase'] > median_purchase]

In [48]:
filtered_data

   CustomerID  Name  Purchase
1           2  Jane     300.0
4           5   Bob     500.0

4) SERIES OPERATIONS : TEMPERATURE DATA

In [2]:
import pandas as pd

In [3]:
temperature = pd.Series([23, 21, 20, 25, 27, 30, 28, 22, 24, 26])

In [8]:
mean_temp = temperature.mean()

In [9]:
mean_temp

np.float64(24.6)

In [5]:
median_temp = temperature.median()

In [10]:
median_temp

np.float64(24.5)

In [6]:
var_temp = temperature.var()

In [11]:
var_temp

np.float64(10.266666666666667)

In [14]:
above_below_mean = temperature.apply(lambda x: 'Above' if x > mean_temp else 'Below')

In [15]:
above_below_mean

0    Below
1    Below
2    Below
3    Above
4    Above
5    Above
6    Above
7    Below
8    Below
9    Above
dtype: object

In [16]:
temperature_kelvin = temperature + 273.15

In [17]:
temperature_kelvin

0    296.15
1    294.15
2    293.15
3    298.15
4    300.15
5    303.15
6    301.15
7    295.15
8    297.15
9    299.15
dtype: float64

In [18]:
rolling_mean = temperature.rolling(window=3).mean()

In [19]:
rolling_mean

0          NaN
1          NaN
2    21.333333
3    22.000000
4    24.000000
5    27.333333
6    28.333333
7    26.666667
8    24.666667
9    24.000000
dtype: float64

In [20]:
std_dev_temp = temperature.std()
filtered_temps = temperature[(temperature < (mean_temp - std_dev_temp)) | (temperature > (mean_temp + std_dev_temp))]

In [21]:
filtered_temps

1    21
2    20
5    30
6    28
dtype: int64

5). MERGING DATAFRAMES : PRODUCT ORDERS

In [22]:
import pandas as pd

In [32]:
orders = pd.DataFrame({'OrderID': [1, 2, 3, 4, 5],'CustomerID': [101, 102, 103, 104, 101],'Product': ['A', 'B', 'A', 'C', 'B'],'Quantity': [2, 1, 4, 2, 3]})
orders

   OrderID  CustomerID Product  Quantity
0        1         101       A         2
1        2         102       B         1
2        3         103       A         4
3        4         104       C         2
4        5         101       B         3

In [33]:
customers = pd.DataFrame({'CustomerID': [101, 102, 103, 104],'Name': ['Alice', 'Bob', 'Charlie', 'David'],'Location': ['New York', 'Los Angeles', 'Chicago', 'Houston']})
customers

   CustomerID     Name     Location
0         101    Alice     New York
1         102      Bob  Los Angeles
2         103  Charlie      Chicago
3         104    David      Houston

In [34]:
merged_df = pd.merge(orders, customers, on='CustomerID')
merged_df

   OrderID  CustomerID Product  Quantity     Name     Location
0        1         101       A         2    Alice     New York
1        2         102       B         1      Bob  Los Angeles
2        3         103       A         4  Charlie      Chicago
3        4         104       C         2    David      Houston
4        5         101       B         3    Alice     New York

In [35]:
location_grouped = merged_df.groupby('Location')['Quantity'].sum().reset_index()
location_grouped

      Location  Quantity
0      Chicago         4
1      Houston         2
2  Los Angeles         1
3     New York         5

In [37]:
customer_order_counts = orders['CustomerID'].value_counts()
customer_order_counts

CustomerID
101    2
102    1
103    1
104    1
Name: count, dtype: int64

In [38]:
top_customer_id = customer_order_counts.idxmax()
top_customer_id

np.int64(101)

In [39]:
top_customer_name = customers[customers['CustomerID'] == top_customer_id]['Name'].values[0]
top_customer_name

'Alice'

In [40]:
merged_df['Total_Quantity'] = merged_df.groupby('Product')['Quantity'].cumsum()
merged_df

   OrderID  CustomerID Product  Quantity     Name     Location  Total_Quantity
0        1         101       A         2    Alice     New York               2
1        2         102       B         1      Bob  Los Angeles               1
2        3         103       A         4  Charlie      Chicago               6
3        4         104       C         2    David      Houston               2
4        5         101       B         3    Alice     New York               4

In [41]:
filtered_df = merged_df[merged_df['Product'].isin(['A', 'B'])]
filtered_df

   OrderID  CustomerID Product  Quantity     Name     Location  Total_Quantity
0        1         101       A         2    Alice     New York               2
1        2         102       B         1      Bob  Los Angeles               1
2        3         103       A         4  Charlie      Chicago               6
4        5         101       B         3    Alice     New York               4